# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[np.nan,np.nan,np.nan],
                  'C':[1,np.nan,np.nan]})

In [3]:
df

     A   B    C
0  1.0 NaN  1.0
1  2.0 NaN  NaN
2  NaN NaN  NaN

In [6]:
df.dropna(axis=0) # rows
# df.dropna() same as above

Empty DataFrame
Columns: [A, B, C]
Index: []

In [7]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [8]:
df

     A   B    C
0  1.0 NaN  1.0
1  2.0 NaN  NaN
2  NaN NaN  NaN

In [43]:
df.dropna(thresh=0,axis=0) # try different values for thresh 0, 1, 2, 3

     A   B    C
0  1.0 NaN  1.0
1  2.0 NaN  NaN
2  NaN NaN  NaN

In [44]:
df.dropna(thresh=1,axis=0) # try different values for thresh 0, 1, 2, 3

     A   B    C
0  1.0 NaN  1.0
1  2.0 NaN  NaN

In [45]:
df.dropna(thresh=2,axis=0) # try different values for thresh 0, 1, 2, 3

     A   B    C
0  1.0 NaN  1.0

In [46]:
df.dropna(thresh=3,axis=0) # try different values for thresh 0, 1, 2, 3

Empty DataFrame
Columns: [A, B, C]
Index: []

In [47]:
df.dropna(thresh=0,axis=1) # try different values for thresh 0, 1, 2, 3

     A   B    C
0  1.0 NaN  1.0
1  2.0 NaN  NaN
2  NaN NaN  NaN

In [48]:
df.dropna(thresh=1,axis=1) # try different values for thresh 0, 1, 2, 3

     A    C
0  1.0  1.0
1  2.0  NaN
2  NaN  NaN

In [49]:
df.dropna(thresh=2,axis=1)

     A
0  1.0
1  2.0
2  NaN

In [50]:
df.dropna(thresh=3,axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

tresh limits the quantity of numbers it will accept to drop

In [58]:
df.fillna(value='FILL VALUE')

            A           B           C
0         1.0  FILL VALUE         1.0
1         2.0  FILL VALUE  FILL VALUE
2  FILL VALUE  FILL VALUE  FILL VALUE

In [59]:
df1 = pd.DataFrame({'A':[5,7,9],
                  'B':[3,np.nan,np.nan],
                  'C':[2,np.nan,np.nan]})
df1

   A    B    C
0  5  3.0  2.0
1  7  NaN  NaN
2  9  NaN  NaN

In [60]:
df1['B'].fillna(value=df1['A'].mean()) # MEAN = MEDIA

0    3.0
1    7.0
2    7.0
Name: B, dtype: float64

In [63]:
df1[['C','B']].fillna(value=df1['A'].mean())

     C    B
0  2.0  3.0
1  7.0  7.0
2  7.0  7.0

In [62]:
df1

   A    B    C
0  5  3.0  2.0
1  7  NaN  NaN
2  9  NaN  NaN